Documents/ЛБ_БланкиЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_БланкиЗалоговыхБилетов</Name>
			<Comment>Оприходование бланков залоговых билетов</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_БланкиЗалоговыхБилетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаБланковОт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНакладной</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БланкиБилетов</Name>
					<Comment>Бланки билетов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Comment>Номер</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>17</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_БланкиЗалоговыхБилетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Заявление на обнуление билета
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрНомеров";
	КомандаПечати.Представление = НСтр("ru = 'Реестр номеров'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктПриемаПередачи";
	КомандаПечати.Представление = НСтр("ru = 'Акт приема-передачи'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
КонецПроцедуры

// Печатает реестр номеров 
//
Функция ПечатьРеестрНомеров(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.Ломбард КАК Ломбард
	|ИЗ
	|	Документ.ЛБ_БланкиЗалоговыхБилетов КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("РеестрНомеров");

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.Реестр = "Реестр №" + Шапка.Номер;//ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер,Истина,Ложь);
	
	ОбластьМакета.Параметры.ВидБилетов = "залоговых";
		
	ТабДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_БланкиЗалоговыхБилетовБланкиБилетов.Номер КАК Номер
	                |ИЗ
	                |	Документ.ЛБ_БланкиЗалоговыхБилетов.БланкиБилетов КАК ЛБ_БланкиЗалоговыхБилетовБланкиБилетов
	                |ГДЕ
	                |	ЛБ_БланкиЗалоговыхБилетовБланкиБилетов.Ссылка В(&МассивОбъектов)
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Номер" ;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьОтступа = Макет.ПолучитьОбласть("Строка|Отступ");
	ОбластьМакета  = Макет.ПолучитьОбласть("Строка|Колонка");
	
	Таблица = Новый ТабличныйДокумент;
	Колонка = Новый ТабличныйДокумент;
	
	СчСтрок   = 0;
	СчКолонок = 0;
	
	ПервыйЛист = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если ПервыйЛист И СчСтрок = 54 ИЛИ НЕ ПервыйЛист И СчСтрок = 58 Тогда
		
			Таблица.Присоединить(Колонка);
			
			Колонка.Очистить();
			СчСтрок = 0;
		
			Если СчКолонок = 4 Тогда
			
				ТабДокумент.Вывести(Таблица);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				Таблица = Новый ТабличныйДокумент;
				СчКолонок = 0;
				
				ПервыйЛист = Ложь;
				
			Иначе
			
				СчКолонок = СчКолонок + 1;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
		
		Если СчКолонок = 0 Тогда
		
			Колонка.Вывести(ОбластьОтступа);
			Колонка.Присоединить(ОбластьМакета);
			
		Иначе
		
			Колонка.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		СчСтрок = СчСтрок + 1;
		
	КонецЦикла; 
	
	Таблица.Присоединить(Колонка);
	ТабДокумент.Вывести(Таблица);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьВедомостьПоНомерам()

// Печатает акт приема-передачи бланков 
//
Функция ПечатьАктПриемаПередачи(МассивОбъектов,ИмяМакета)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК ДатаОприходования,
	|	Документ.Организация КАК Организация,
	|	Документ.Ломбард КАК Ломбард,
	|	Документ.ПоставкаБланковОт КАК ПоставкаБланковОт
	|ИЗ
	|	Документ.ЛБ_БланкиЗалоговыхБилетов КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_БланкиЗалоговыхБилетовБланкиБилетов.Номер КАК Номер,
	               |	ЛБ_БланкиЗалоговыхБилетовБланкиБилетов.Количество КАК Количество
	               |ИЗ
	               |	Документ.ЛБ_БланкиЗалоговыхБилетов.БланкиБилетов КАК ЛБ_БланкиЗалоговыхБилетовБланкиБилетов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
	ТаблицаНомеров = Запрос.Выполнить().Выгрузить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("АктПриемаПередачи");

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.Номер = Шапка.Номер;//ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер,Истина,Ложь);
	ОбластьМакета.Параметры.ДатаОприходования = Формат(Шапка.ДатаОприходования,"ДЛФ=ДД");
	ТабДокумент.Вывести(ОбластьМакета);
			
	ОбластьМакета = Макет.ПолучитьОбласть("ОсновнаяЧасть");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);
	
	
	ОбщееКоличество = 0;
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	НачНомер=ТаблицаНомеров.Получить(0).Номер;
	КонНомер=ТаблицаНомеров.Получить(ТаблицаНомеров.Количество()-1).Номер;
	ОбластьМакета.Параметры.НачНомер = НачНомер;
	ОбластьМакета.Параметры.КонНомер = КонНомер;
	Количество = ТаблицаНомеров.Итог("Количество");
	ОбластьМакета.Параметры.Количество = Количество;
	ОбщееКоличество = ОбщееКоличество + Количество; 
	ТабДокумент.Вывести(ОбластьМакета);
			
	ОбластьМакета = Макет.ПолучитьОбласть("ОсновнаяЧастьП");
	//ОбластьМакета.Параметры.Заполнить(ИнформацияПоБилетам);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(ОбластьМакета);
	ТабДокумент.Вывести(ОбластьМакета);


	Возврат ТабДокумент;

КонецФункции 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета РеестрНомеров формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрНомеров") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрНомеров", "Реестр номеров", 
		ПечатьРеестрНомеров(МассивОбъектов), , "Документ.ЛБ_БланкиЗалоговыхБилетов.РеестрНомеров");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемаПередачи") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПриемаПередачи", "Акт приема-передачи", 
		ПечатьАктПриемаПередачи(МассивОбъектов,"АктПриемаПередачи"), , "Документ.ЛБ_БланкиЗалоговыхБилетов.АктПриемаПередачи");
	КонецЕсли;
	
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
	
КонецПроцедуры


#КонецЕсли
